In [ ]:
"""
1. Write a function that takes start and end of a range returns a Pandas series object containing
numbers within that range.
In case the user does not pass start or end or both they should default to 1 and 10 respectively.
eg.
 range_series() -> Should Return a pandas series from 1 to 10
 range_series(5) -> Should Return a pandas series from 5 to 10
 range_series(5, 10) -> Should Return a pandas series from 5 to 10. 
"""

In [30]:
import pandas as pd

In [31]:
def range_series(a=1,b=10):
    data = []
    for i in range(a,b+1):
        data.append(i)
    
    series_obj = pd.Series(data)

    return series_obj

In [39]:
range_series()

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [40]:
range_series(5)

0     5
1     6
2     7
3     8
4     9
5    10
dtype: int64

In [41]:
range_series(5,10)

0     5
1     6
2     7
3     8
4     9
5    10
dtype: int64

In [ ]:
"""
2. Create a function that takes in two lists named keys and values as arguments.
Keys would be strings and contain n string values.
Values would be a list containing n lists. 
"""

In [66]:
def create_dataframe(keys,values):
    df = pd.DataFrame(values, columns=keys)
    
    return df

In [68]:
create_dataframe(["One","Two"],[["X","Y"],["A","B"]])

  One Two
0   X   Y
1   A   B

In [ ]:
"""
3. Create a function that concatenates two dataframes. Use previously created function to create
two dataframes and pass them as parameters Make sure that the indexes are reset before
returning: 
"""

In [73]:
def concat_df(a,b):
    new_df = pd.concat([a,b],ignore_index=True)
    return new_df

In [74]:
a = create_dataframe(["One","Two"],[["X","Y"],["A","B"]])
b = create_dataframe(["Three","Four"],[["P","Q"],["C","D"]])

In [75]:
concat_df(a,b)

   One  Two Three Four
0    X    Y   NaN  NaN
1    A    B   NaN  NaN
2  NaN  NaN     P    Q
3  NaN  NaN     C    D

In [76]:
"""
4. Write code to load data from cars.csv into a dataframe and print its details. Details like: 'count',
'mean', 'std', 'min', '25%', '50%', '75%', 'max'. 
"""

"\n4. Write code to load data from cars.csv into a dataframe and print its details. Details like: 'count',\n'mean', 'std', 'min', '25%', '50%', '75%', 'max'. \n"

In [78]:
cars = pd.read_csv("C:\\Users\\black\\Desktop\\PyforDS\\datasets\\cars.csv")
cars.head()

,S.No,model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,1,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,2,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,3,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,4,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,5,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [86]:
cars.describe()

,S.No,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
count,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,29.000000,32.000000,32.000000,32.000000,32.0000
mean,16.500000,20.090625,6.187500,230.721875,146.687500,3.596563,3.217250,17.674828,0.437500,0.406250,3.687500,2.8125
std,9.380832,6.026948,1.785922,123.938694,68.562868,0.534679,0.978457,1.780394,0.504016,0.498991,0.737804,1.6152
min,1.000000,10.400000,4.000000,71.100000,52.000000,2.760000,1.513000,14.500000,0.000000,0.000000,3.000000,1.0000
25%,8.750000,15.425000,4.000000,120.825000,96.500000,3.080000,2.581250,16.870000,0.000000,0.000000,3.000000,2.0000
50%,16.500000,19.200000,6.000000,196.300000,123.000000,3.695000,3.325000,17.420000,0.000000,0.000000,4.000000,2.0000
75%,24.250000,22.800000,8.000000,326.000000,180.000000,3.920000,3.610000,18.600000,1.000000,1.000000,4.000000,4.0000
max,32.000000,33.900000,8.000000,472.000000,335.000000,4.930000,5.424000,22.900000,1.000000,1.000000,5.000000,8.0000

In [ ]:
"""
5. Write a method that will take a column name as argument and return the name of the column
with which the given column has the highest correlation.
The data to be used is the cars dataset.
The returned value should not be the column named that was passed as the parameters.
E.G: get_max_correlated_column('mpg') -> should return 'drat' 
"""

In [238]:
def max_corr(a):
    corr_a = pd.DataFrame(cars[cars.columns[cars.columns.get_loc(a):]].corr()[3:])
    max_corr_1 = pd.DataFrame(corr_a.sort_values(by=[a], ascending=[False]).head(1))
    print(max_corr_1.index[0])

a = str(input("Enter column name: "))
max_corr(a)

Enter column name: mpg
drat